export const EngTextArray = [
    "Hi Nancy ^^. Hope you're having a nice day. First of all, can we keep this a secret between us for now?",
    "Hi Nancy ^^. Hope you're having a nice day. First of all, can we keep this a secret between us for now?",
    "طيب أسف لو بتدخل ف حاجات متخصنيش بس لازم أسال. هل انتى مرتبطة؟",
    "حلو اوى. طب انا كنت حابب نتعرف على بعض اكتر ف هل انتى انترستد؟",
    ""
];

// export const ArbTextArray = [
//     "ازيك يا نانسى ^^. اتمنى تكونى بخير.",
//     "Hii",
//     "Hiii"
// ];

export const MyInfoTextArray = [
    "This is me. Hi ^^",
    "It's a me. Mario.",
    "Nice to meet you.",
    "(;"
];

export const MyInfoTextDetails = [
    "طيب هو المفروض احكى عن نفسى بس انا الحقيقة معنديش اى فكرة اكتب ايه 😂. أنا اسمى ماريو (duh 🙄). بصى دوسى نكست عشان شكلى مش هكتب حاجة مفيدة. نخلى الكلام دا ف صفحة قدام شوية 😂.",
    "",
    "",
    ""
];

export const PerksText = [
    "هخليكى تختارى معايا الهوديز بتوعى عشان نلبسهم سوا 😂😎",
    "عيالك مش هيبقى عندهم عمتو حرباية 😂. هيبقى عندهم احلى عمتو ف الدنيا.",
    "ست بيت شاطر و اكلى هيعجبك 😌😂",
    "بعشق الليل و البرد و الشتا و القمر (اظن واضح 🌚😂) و النجوم و شكلنا هنقضيها star gazing",
    "هنبقى نعمل شبابيك ازاز كتير ف البيت عشان خاطر عيون ال NYCTOPHILE 😉"
];

export const PerksDetailsText = [
    "",
    "( و بما اننا جبنا سيرة الاخوات ف حبيت اقولك ان اخوكى نادر لذيذ و كيوت جداا 😂😂. يوسف للاسف معرفش عنه كتير عشان مش بيشير حاجة عالسوشيال ميديا. بس كيوت جداا برضو. و لحد دلوقتى مش قادر احدد مين فيكوا الكبير و مين الصغير )",
    "",
    "",
    "( الحمدلله على نعمة جوجل عمرى ما كنت اسمع عن النيكتوفيل دا كنت فاكره دوا كحة )"
];

export const DrawbacksText = [
    "اخدت بالى انك بتحبى تبقى مكتئبة بس للاسف هتضطرى تبقى مبسوطة 🤷‍♂️",
    "صوتى مش قد كدا بس بحب اغنى فالبيت كتير ف هتضطرى تستحملى الاوبرا عايدة 😂",
    "بكره الصبح و الحر و الشمس و مودى بيبقى وحش اغلب الوقت ف الصيف 🤦‍♂️",
    "متنمر جداا بس كريتيف و بعرف اضحك 😈",
    "عندى social anxiety رهيبة.. مبستحملش اكون ف مكان فيه ناس كتير و اكبر فيلم رعب بالنسبالى انى اكون ف مكان الناس كلها بتبص عليا فيه"
];

export const DrawbacksDetailsText = [
    "( او هنبقى مكتئبين سوا ايهما اقرب )",
    "",
    "( تسمعى عن البيات الصيفى؟ 😂 )",
    "",
    "( I'm not a psychopath. I'm a high functioning sociopath. XD )"
];